Рабочая.Задачи2/src/Enums/ЦБР_РольВЗадаче/ЦБР_РольВЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_РольВЗадаче</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>КураторИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>КураторПостановщика</name>
  </enumValues>
  <enumValues>
    <name>ВладелецЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительРазработчик</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительАналитик</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/CommonModules/ЦБР_ВидимостьДоступностьЭлементовФормыКлиент/Module.bsl
#Область СлужебныеПроцедурыИФункции 


// Процедура - Видимость контекстного меню в задаче
//
// Параметры:
//  ЭтотОбъект         -   ОбъектЗадачи   - 
//  РольВЗадаче         -   Перечисление.ЦБР_РольВЗадаче   - 
//  СвойстваЭтапа     -   Структура   -   Содержит свойства строки для определения видимости команд контекстного меню в зависимости от их значения
//
Процедура ВидимостьКонтекстногоМенюВЗадаче(ЭтотОбъект, РольВЗадаче, СвойстваЭтапа = Неопределено) Экспорт  
    
    Если СвойстваЭтапа = Неопределено тогда
        Возврат
    Иначе
        Если СвойстваЭтапа.Свойство("Состояние") Тогда
            Состояние = СвойстваЭтапа.Состояние;
        Иначе
            Состояние = Неопределено;
        КонецЕсли;
        Если СвойстваЭтапа.Свойство("ЭтоГруппа") Тогда
            ЭтоГруппа = СвойстваЭтапа.ЭтоГруппа;
        Иначе
            ЭтоГруппа = Неопределено;
        КонецЕсли;
        Если СвойстваЭтапа.Свойство("ПометкаУдаления") Тогда
            ПометкаУдаления = СвойстваЭтапа.ПометкаУдаления;
        Иначе
            ПометкаУдаления = Неопределено;
		КонецЕсли;
		Если СвойстваЭтапа.Свойство("ЕстьЗадание") Тогда
			ЕстьЗадание = СвойстваЭтапа.ЕстьЗадание;
		Иначе
			ЕстьЗадание = Ложь;
		КонецЕсли;
    КонецЕсли;
    
    Элементы    = ЭтотОбъект.Элементы; 
    //@skip-check module-self-reference
    Объект      = ЭтотОбъект.Объект; 
    
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюСоздатьПодчиненныйЭтап", "Видимость", Ложь);    
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюСоздатьКодРевью", "Видимость", Ложь);  
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюСоздатьТестирование", "Видимость", Ложь);  
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюДобавитьЧасыКЗаданию", "Видимость", Ложь);  
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюУдалитьЭтап", "Видимость", Ложь);  
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюПересогласоватьЭтап", "Видимость", ЕстьЗадание);
    
    Если ПометкаУдаления Тогда            
        Возврат;  
    КонецЕсли;

    #Область РольТекущегоПользователя
    
    Если РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.Наблюдатель") Тогда
        Возврат;
    КонецЕсли;
              
    Если Объект.Постановщик = ПользователиКлиентСервер.АвторизованныйПользователь() Тогда
        яПостановщик                = Истина;
    Иначе
        яПостановщик                = Ложь;
    КонецЕсли;
    
    Если Объект.Куратор = ПользователиКлиентСервер.АвторизованныйПользователь() Тогда
        яКуратор                = Истина;
    Иначе
        яКуратор                = Ложь;
    КонецЕсли;
    яРуководительПостановщика   = Ложь;
    
    яИсполнитель                = Ложь;
    яРуководительИсполнителя    = Ложь;
    яВладелецЗадачи             = Ложь;
    
    Если РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.Постановщик") Тогда
        яПостановщик = Истина;
    ИначеЕсли РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.КураторПостановщика") Тогда
        яРуководительПостановщика = Истина;
    ИначеЕсли РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.Исполнитель")
        ИЛИ РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.ИсполнительРазработчик")
        ИЛИ РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.ИсполнительАналитик") Тогда
        яИсполнитель = Истина;
    ИначеЕсли РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.КураторИсполнителя") Тогда
        яРуководительИсполнителя = Истина;
    ИначеЕсли РольВЗадаче = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.ВладелецЗадачи") Тогда
        яВладелецЗадачи = Истина;
    КонецЕсли;
    
    
#КонецОбласти

#Область ВидимостьКомандКонтекстногоМенюВЗависимостиОтРолиИСостоянияЭтапа   

    Если яРуководительПостановщика Тогда
#Область ОпределениеВидимостиПоСостояниюЭтапа  
//Тут прописываем условия видимости в зависимости от свойства "Состояние"      
              
              
        Если Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Согласован") Тогда
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Истина);
        КонецЕсли;
        
        
#КонецОбласти   
    КонецЕсли; 

    Если яИсполнитель ИЛИ яКуратор ИЛИ яРуководительИсполнителя Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюСоздатьПодчиненныйЭтап", "Видимость", Истина);    
        
        
        Если ЭтоГруппа <> Неопределено Тогда 
#Область ОпределениеВидимостиГруппаЛиЭто 
//Тут прописываем условия видимости в зависимости от свойства "ЭтоГруппа"    

   
		Если НЕ ЭтоГруппа Тогда
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюЗавершитьЭтап", "Видимость", Истина);
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюДобавитьЧасыКЗаданию", "Видимость", Истина);
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюСоздатьТестирование", "Видимость", Истина);
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюСоздатьКодРевью", "Видимость", Истина);
            КонецЕсли; 
            
             
#КонецОбласти
        КонецЕсли;
          
          
        Если Состояние <> Неопределено Тогда  
#Область ОпределениеВидимостиПоСостояниюЭтапа  
//Тут прописываем условия видимости в зависимости от свойства "Состояние" 
          
            
            Если Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Черновик") ИЛИ
                Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.ПустаяСсылка") Тогда
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюУдалитьЭтап", "Видимость", Истина);     
            КонецЕсли; 
            
            Если Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Приостановлен") Тогда
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюЗавершитьЭтап", "Видимость", Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийРазбитьЗадание", "Видимость", Истина);
            КонецЕсли;  
            
            Если Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Черновик") Тогда
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюДобавитьЧасыКЗаданию", "Видимость", Истина);
            КонецЕсли;  
            
            Если Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Согласован") Тогда
                ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюПересогласоватьЭтап", "Видимость", Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийРазбитьЗадание", "Видимость", Истина);
			КонецЕсли;
			
			Если Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Выполнен") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийРазбитьЗадание", "Видимость", Истина);
			КонецЕсли;
#КонецОбласти              
        КонецЕсли;
 
        
    КонецЕсли;

    
#КонецОбласти        
     ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийРазбитьЗадание", "Видимость", Ложь);
КонецПроцедуры     


#КонецОбласти
